s60sc/ESP32-CAM_MJPEG2SD/mjpeg2sd.cpp
#if defined(CAMERA_MODEL_M5STACK_WIDE)
      s->set_vflip(s, 1);
      s->set_hmirror(s, 1);
#endif

#if defined(CAMERA_MODEL_M5STACK_WIDE) || defined(CAMERA_MODEL_M5STACK_ESP32CAM)
      s->set_vflip(s, 1);
      s->set_hmirror(s, 1);
#endif

#if defined(CAMERA_MODEL_ESP32S3_EYE)
      s->set_vflip(s, 1);
#endif
      res = true;
    }
  }
  // check that camera data is accessible
  if (res) {
    camera_fb_t* fb = esp_camera_fb_get();
    if (fb == NULL) {
      // usually a camera hardware / ribbon cable fault
      snprintf(startupFailure, SF_LEN, STARTUP_FAIL "Failed to get camera frame - check camera hardware");
    } else {
      esp_camera_fb_return(fb);
      fb = NULL;
      res = true;
      LOG_INF("Camera model %s ready @ %uMHz", camModel, xclkMhz);
      if (timeLapseOn) dashCamOn = 0;
      if (dashCamOn) {
        timeLapseOn = useMotion = false; // disable timeLapse and motion recording
        frameLimit = FPS * dashCamOn * 60; // frameLimit is not changed if FPS later changed without restart
        if (frameLimit > maxFrames) {
          frameLimit = maxFrames;
          LOG_WRN("Max continuous recording time interval is %d mins", frameLimit / FPS / 60);
        } else LOG_INF("Do continuous recording at %d min intervals", dashCamOn);
        forceRecord = true;
      } else frameLimit = maxFrames;
    }
  }
  debugMemory("prepCam");
  return res;
}

#else

// dummies
void appShutdown() {}
void OTAprereq() {}
uint8_t setFPSlookup(uint8_t val) {
  return 0;
}

#endif
